---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperValue
source: html/5f1a2b05-f4e3-84b9-59c9-9691c6aac7cd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevSingleOrUpperValue Property

"Single/Upper Value"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevSingleOrUpperValue { get; }
```